data/perf/campaign-f3deebfbab60/flag-mysql/mysql/tsan-dom_peeling-ea-lo-st-swmr-nofe/run4/oltp_read_only.txt
Sysbench script: /usr/share/sysbench/oltp_read_only.lua
sysbench /usr/share/sysbench/oltp_read_only.lua --mysql-user=root --mysql-socket=/tmp/mysql.sock  --threads=36 --time=180 --rand-type=special run | awk '/Latency \(ms\):/ { exit; } 1'
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 36
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            106260
        write:                           0
        other:                           15180
        total:                           121440
    transactions:                        7590   (42.06 per sec.)
    queries:                             121440 (672.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          180.4643s
    total number of events:              7590

MySQL build: ..